# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [3]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [6]:
cars1 = cars1.loc[:, 'mpg':'car']
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [8]:
print(cars1.shape[0])
print(cars2.shape[0])

198
200

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [9]:
cars = cars1.append(cars2)
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [11]:
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([26758, 33107, 30709, 55834, 15460, 25448, 66506, 50547, 71763,
       45400, 52398, 69346, 56741, 53735, 50038, 61972, 34350, 27452,
       30081, 32209, 58663, 54711, 69533, 45374, 30188, 72689, 18985,
       30850, 69085, 48723, 17889, 50748, 22720, 40927, 48896, 53332,
       53826, 22307, 62385, 48934, 43418, 54208, 60553, 30433, 60132,
       49405, 53253, 66774, 40943, 36054, 72705, 54657, 51413, 17245,
       68710, 58213, 58171, 72318, 63700, 29498, 57166, 33801, 17110,
       32550, 25980, 43229, 15840, 32577, 26872, 48958, 54677, 24577,
       56548, 49569, 52639, 18032, 26926, 30226, 43433, 65206, 59523,
       49178, 72350, 25714, 65365, 35221, 16769, 58843, 71036, 49198,
       27854, 52825, 56491, 27555, 48276, 31947, 31949, 54386, 15422,
       61169, 23523, 35318, 19207, 25232, 52522, 56864, 35659, 29115,
       21019, 63032, 25049, 64866, 45750, 70174, 69090, 40444, 50864,
       52171, 58110, 62035, 61507, 54499, 42008, 36431, 72378, 21332,
       52186, 34725, 58714, 60564, 70641, 34178, 26858, 36676, 50917,
       53447, 30254, 65321, 42583, 58807, 67233, 41713, 28560, 36661,
       18734, 62866, 16456, 15803, 46011, 54319, 15706, 45787, 40796,
       52547, 21130, 58385, 55693, 40786, 42963, 35656, 42832, 44579,
       66321, 20687, 49242, 72554, 30764, 25215, 24464, 63200, 68171,
       23872, 58726, 24797, 37973, 72094, 53395, 24600, 66779, 70499,
       48285, 62305, 39716, 22649, 48302, 40394, 57453, 63907, 28181,
       55094, 21549, 50372, 56653, 16141, 41976, 17852, 43242, 19295,
       17976, 37901, 63255, 20950, 49026, 26942, 44028, 36680, 42464,
       53467, 15962, 39584, 47902, 19353, 52117, 67160, 68580, 31582,
       43798, 62860, 63896, 42799, 27343, 68055, 23493, 68355, 29964,
       34513, 34035, 44742, 62569, 53001, 69979, 68871, 71020, 70250,
       59606, 38280, 37406, 16468, 45210, 46720, 37323, 32240, 70525,
       72168, 19038, 53820, 62002, 24333, 23131, 23891, 35900, 67609,
       58828, 30545, 35185, 49503, 29544, 51561, 29197, 19594, 57818,
       43379, 44438, 53444, 41241, 64205, 70941, 61344, 60724, 30309,
       27411, 22250, 26115, 24660, 47423, 57953, 58299, 47352, 40774,
       55209, 65896, 49908, 58946, 57407, 26055, 17873, 71990, 19862,
       43418, 47923, 66896, 64074, 66217, 71275, 54799, 26441, 51878,
       45621, 24688, 59084, 67935, 36712, 60223, 23530, 60599, 32426,
       32189, 21069, 45586, 20578, 42729, 45694, 32996, 50846, 44298,
       27342, 46566, 70777, 67500, 47825, 61668, 33487, 56291, 26435,
       46586, 29366, 28244, 48809, 41312, 33729, 35296, 20409, 32054,
       34120, 52572, 68711, 20086, 62463, 30453, 47829, 71777, 58896,
       27516, 54247, 22245, 63645, 15824, 22241, 51453, 64935, 60854,
       64181, 55861, 67954, 67037, 57572, 38303, 51815, 67399, 16349,
       71342, 61971, 54631, 68978, 32318, 44354, 41589, 64463, 62733,
       26327, 23996, 66912, 38063, 53563, 53090, 16723, 67990, 46132,
       33844, 55571, 31012, 62708, 20307, 58328, 46957, 56276, 16734,
       54789, 22719, 20730, 35543, 19462, 47619, 30343, 43333, 23588,
       52108, 40919])

### Step 8. Add the column owners to cars

In [12]:
cars['owners'] = nr_owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,26758
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,33107
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,30709
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,55834
4,17.0,8,302,140,3449,10.5,70,1,ford torino,15460